/*
 * =====================================================================================
 *
 *       Filename:  水仙花数.c
 *
 *    Description:  一个三位数，其各位数字的立方和等于该数本身，此数被称为“水仙花数”，如153 = 1^3 + 5^3 + 3^3
 *
 *        Version:  1.0
 *        Created:  2015年02月20日 20时17分45秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  YOUR NAME (), 
 *   Organization:  
 *
 * =====================================================================================
 */
/*
1
371
153
407
*/
#include <stdio.h>

void main()
{
    int i, j, k, m;
    for(i = 1; i <= 9; i++)
    {
        for(j = 0; j <= 9; j++)
        {
            for(k = 0; k <= 9; k++)
            {
                m = 100 * i + 10 * j + k;
                if(m == i*i*i + j*j*j + k*k*k)
                    printf("%d = %d^3 + %d^3 + %d^3\n", m, i, j, k);
            }

        }
    }
}
